Documents/Чат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Чат</Name>
			<Comment>Чат</Comment>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваров</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
				<xr:Item>Document.СписаниеТоваров</xr:Item>
				<xr:Item>Document.РасходныйСкладскойОрдер</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.СписаниеТМЦ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТМЦПереданныеСотрудникам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентированныйУчет</Name>
					<Comment>Флаг отражения документа в регламентированном учете</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщикуIT</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетОтПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйСкладскойОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйСкладскойОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен закупки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Comment>Дата операции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс валюты документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеПереписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧатЗавершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизит1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
					<Comment>Состав</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>id</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>text</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>createdAt</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>from1s</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДопроведениеПоПартиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДопроведениеПоПартиям</Name>
			<Comment>Список документов которые необходимо допровести по партиям</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ДоходыИРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДоходыИРасходы</Name>
			<Comment>Блок учета доходов и расходов</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоходУпр</Name>
					<Comment>Сумма дохода в управленческой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходУпр</Name>
					<Comment>Сумма расхода в управленческой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРаспределения</Name>
					<Comment>Статья прибылей и убытков, с которой произошло распределение суммы дохода\расхода при выполнении закрытия периода</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтатьяДоходовИРасходов</Name>
					<Comment>Статья доходов и расходов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПартииТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровКомпании</Name>
			<Comment>Блок учета партий товаров компании собственных и принятых на комиссию</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток товара на складе в разрезе партий</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщикуАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.АктРазногласий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию товар</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ДоговорыКонтрагентовПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДоговорыКонтрагентовПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоговорПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КонтрагентДляДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Чат/Ext/ObjectModule.bsl
//Модуль документа ПоступлениеТоваров
 
 ////////////////////////////////////////////////////////////////////////////////
 // ПЕРЕМЕННЫЕ ОБЪЕКТА
 
 Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
 Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
 Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ
 Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
 
 ////////////////////////////////////////////////////////////////////////////////
 // ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА
 
 //Бондаренко++ 20200415
 Функция ВыполнитьПостЗапросМодуль() Экспорт
	КодВозврата = Истина;
	#Если Клиент Тогда
	Сообщить("Post-запрос выполнен в "+ТекущаяДата());
	#КонецЕсли
	Возврат  КодВозврата;
 КонецФункции
 //Бондаренко-- 20200415
  
 // Возвращает соответствие в котором перечислены виды номенклатуры, которые нельзя вводить
 // в таблицу товаров. Если таких нет, то возвращает неопределено
 //
 // Возвращаемое значение:
 //  Результат - соответствие.
 //
 Функция ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры() Экспорт
	 Результат=Неопределено;
	 Если ХозОперация=Справочники.ХозОперации.ПоступлениеТоваровКомиссия Тогда
		 Результат=Новый Соответствие();
		 Результат.Вставить(Перечисления.ВидыНоменклатуры.Услуга,0);
	 КонецЕсли;
	 
	 Возврат Результат;
 КонецФункции // ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры()
 
 // Возвращает структуру обязательных / уникальных реквизитов документа
 // Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
 // Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
 Функция ПолучитьОбязательныеРеквизиты() Экспорт
	 // Обязательные поля таблицы товаров
	 ОбязательныеТовары=Новый Структура();
	 ОбязательныеТовары.Вставить("Номенклатура",3);
	 ОбязательныеТовары.Вставить("Характеристика",3);
	 ОбязательныеТовары.Вставить("Количество",1);
	 ОбязательныеТовары.Вставить("ЕдиницаИзмерения",3);
	 ОбязательныеТовары.Вставить("Коэффициент",1);
	 ОбязательныеТовары.Вставить("Цена",1);
	 ОбязательныеТовары.Вставить("Сумма",1);
 	ОбязательныеТовары.Вставить("СуммаВсего",1);
 
	 
	 // Обязательные реквизиты документа
	 ОбязательныеРеквизиты=Новый Структура();
	 ОбязательныеРеквизиты.Вставить("Организация",1);
	 ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	 ОбязательныеРеквизиты.Вставить("Автор",1);
	 ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	 ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
 	 //ОбязательныеРеквизиты.Вставить("Контрагент",1);
	 ОбязательныеРеквизиты.Вставить("ТипЦен",1);
	 ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	 //ОбязательныеРеквизиты.Вставить("ДоговорВзаиморасчетов",1);
	 ОбязательныеРеквизиты.Вставить("ДилерскийЦентр",1);
	 ОбязательныеРеквизиты.Вставить("Товары",ОбязательныеТовары);
	 
	 //Гэндальф+++
	 //ОбязательныеРеквизиты.Вставить("ВхДокНомер",1);
	 //ОбязательныеРеквизиты.Вставить("ВхДокДата",1);
	 //Гэндальф---
	 Возврат ОбязательныеРеквизиты;
 КонецФункции // ПолучитьОбязательныеРеквизиты()
 
 // Проверяет корректность заполнения объекта.
 // может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
 // (могут быть и другие необязательные)
 // Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
 //
 // Параметры:
 //  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
 //  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
 //  Заполнение   - булево, флаг проверки, 
 //  Уникальность - булево, флаг проверки.
 //
 // Возвращаемое значение:
 //  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
 // 
 Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
 	 Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Ложь, Истина);
 
 	 
 	 
 	 
	 Возврат Результат;
 КонецФункции // ПроверитьКорректность()
 
 // Функция проверяет, допустимо ли изменение объекта
 //
 // Параметры:
 //  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
 //
 // Возвращаемое значение:
 // Булево - Возвращает Истина, если изменения возможны, ложь иначе
 //          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
 //
 Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	 // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	 Возврат Истина;
 КонецФункции // ДоступностьИзменения()
 
 // Возвращает список возможных хозяйственных операций документа
 // Возвращаемое значение: 
 //  СписокЗначений. 
 //  Строка списка: Значение - имя предопределенного элемента; 
 //				   Представление - красивое его представление
 // 				   "Помеченная" строка - ХО по умолчанию.
 Функция ПолучитьСписокХозОпераций() Экспорт
	 СписокХозОпераций = Новый СписокЗначений;
	 СписокХозОпераций.Добавить("ПоступлениеТМЦсотрудников","Поступление ТМЦ сотрудников",Истина);
	 Возврат СписокХозОпераций;
 КонецФункции // ПолучитьСписокХозОпераций()
 
 // формирует движения документа по партионным регистрам
 //
 // Параметры:
 //  Режим           - режим проведения (оперативный/неоперативный)
 //  ДокументСсылка  - ссылка на документ который надо допровести по партиям
 //
 // Возвращаемое значение:
 //  Возвращает Истина - все ОК, ложь - чего-то не так
 //
 Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	 Отказ=Ложь;
	 
	 // получим шапку документа
	 ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	 
	 // посчитаем суммы товаров и услуг
	 Запрос=Новый Запрос("
	 |ВЫБРАТЬ
	 |	ВЫБОР КОГДА ДокументТовары.Номенклатура.ВидНоменклатуры=&Услуга И ДокументТовары.Номенклатура.СпособРаспределенияДопРасходов=&НаДоходыРасходы ТОГДА &Услуга ИНАЧЕ &Товар КОНЕЦ КАК ВидНоменклатуры,
	 |	ВЫБОР КОГДА ДокументТовары.Номенклатура.ВидНоменклатуры=&Услуга ТОГДА ДокументТовары.Номенклатура.СтатьяДопРасходов ИНАЧЕ NULL КОНЕЦ КАК СтатьяДопРасходов,
	 |	СУММА(ДокументТовары.СуммаВсего) КАК СуммаВсего
	 |ИЗ
	 |	Документ.ПоступлениеТоваров.Товары 	КАК ДокументТовары
	 |
	 |ГДЕ  
	 |	ДокументТовары.Ссылка = &ДокументСсылка
	 |
	 |СГРУППИРОВАТЬ ПО 
	 |	ВЫБОР КОГДА ДокументТовары.Номенклатура.ВидНоменклатуры=&Услуга И ДокументТовары.Номенклатура.СпособРаспределенияДопРасходов=&НаДоходыРасходы ТОГДА &Услуга ИНАЧЕ &Товар КОНЕЦ,
	 |	ВЫБОР КОГДА ДокументТовары.Номенклатура.ВидНоменклатуры=&Услуга ТОГДА ДокументТовары.Номенклатура.СтатьяДопРасходов ИНАЧЕ NULL КОНЕЦ
	 |
	 |ИТОГИ ПО ВидНоменклатуры
	 |");
	 Запрос.УстановитьПараметр("ДокументСсылка",ШапкаДокумента.Ссылка);
	 Запрос.УстановитьПараметр("Услуга",Перечисления.ВидыНоменклатуры.Услуга);
	 Запрос.УстановитьПараметр("Товар",Перечисления.ВидыНоменклатуры.Товар);
	 Запрос.УстановитьПараметр("НаДоходыРасходы",Перечисления.СпособыРаспределенияДопРасходов.НаДоходыИРасходы);
	 ДеревоДоходовИРасходов=Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	 
	 ВедетсяБалансПоПодразделению = (Константы.СпособВеденияБаланса.Получить() = Перечисления.СпособВеденияБаланса.ПоПодразделению);
	 
	 // проверим, если подразделение проводиться по партиям "отложенно", то дальше не идем
	 НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	 НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	 НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	 Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	 Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		 НайденнаяСтрокаТоваров=ДеревоДоходовИРасходов.Строки.Найти(Перечисления.ВидыНоменклатуры.Товар,"ВидНоменклатуры");
		 НайденнаяСтрокаУслуг=ДеревоДоходовИРасходов.Строки.Найти(Перечисления.ВидыНоменклатуры.Услуга,"ВидНоменклатуры");
		 Если ШапкаДокумента.ХозОперация<>Справочники.ХозОперации.ПоступлениеТоваровКомиссия И ШапкаДокумента.ХозОперация<>Справочники.ХозОперации.ПоступлениеБезвозмездное И
			 (НайденнаяСтрокаТоваров<>Неопределено ИЛИ НайденнаяСтрокаУслуг<>Неопределено) Тогда
			 // Доходы и расходы на себестоимость не оприходованных партий
			 СуммаВсего=?(НайденнаяСтрокаТоваров<>Неопределено,НайденнаяСтрокаТоваров.СуммаВсего,0)+?(НайденнаяСтрокаУслуг<>Неопределено,НайденнаяСтрокаУслуг.СуммаВсего,0);
			 НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			 НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
			 // в случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
			 Если ВедетсяБалансПоПодразделению Тогда
				 НаборЗаписейДоходыИРасходы.ПодразделениеКомпании=ШапкаДокумента.СкладКомпании.ПодразделениеКомпании;
			 КонецЕсли;
			 НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
			 НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
			 НаборЗаписейДоходыИРасходы.ВУпрВалюте = Ложь;
			 НаборЗаписейДоходыИРасходы.Расход = СуммаВсего;
			 НаборЗаписейДоходыИРасходы.Приход();
		 КонецЕсли;
		 Возврат НЕ Отказ;
	 КонецЕсли;
	 
	 // определим необходимость формирования корректирующих проводок
	 
	 
	 НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
	 НаборЗаписейПартии.ДокументОбъект=ЭтотОбъект;
	 НаборЗаписейПартии.СкладКомпании=ШапкаДокумента.СкладКомпании;
	 НаборЗаписейПартии.ЕстьСтавкаНДС=Истина;
	 Если ШапкаДокумента.ХозОперация=Справочники.ХозОперации.ПоступлениеТоваровКомиссия Тогда
		 НаборЗаписейПартии.СтатусПартии=Перечисления.СтатусыПартий.ТоварПринятыйКомиссия;
	 Иначе
		 НаборЗаписейПартии.СтатусПартии=Перечисления.СтатусыПартий.ТоварКупленный;
	 КонецЕсли;
	 НаборЗаписейПартии.ПоБазовомуКоличеству=Истина;
	 НаборЗаписейПартии.ШапкаДокумента=ШапкаДокумента;	
	 НаборЗаписейПартии.РежимДопРасходы	= 1;	
	 Отказ=НЕ НаборЗаписейПартии.Приход() ИЛИ Отказ;
	 
	 // запишем в ДоходыИРасходы услуги стоимость которых не распределяется на себестоимость поступления
	 НайденнаяСтрокаУслуг=ДеревоДоходовИРасходов.Строки.Найти(Перечисления.ВидыНоменклатуры.Услуга,"ВидНоменклатуры");
	 Если НайденнаяСтрокаУслуг<>Неопределено Тогда
		 СуммаУслуг = 0;
		 Для Каждого СтрокаУслуги Из НайденнаяСтрокаУслуг.Строки Цикл
			 НаборЗаписейДиР = Движения.ДоходыИРасходы;
			 НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			 // в случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
			 Если ВедетсяБалансПоПодразделению Тогда
				 НаборЗаписейДиР.Подразделение=ШапкаДокумента.СкладКомпании.Подразделение;
			 КонецЕсли;
			 НаборЗаписейДиР.ШапкаДокумента = ШапкаДокумента;
			 НаборЗаписейДиР.СтатьяДоходовИРасходов = СтрокаУслуги.СтатьяДопРасходов;
			 НаборЗаписейДиР.ВУпрВалюте = (ШапкаДокумента.ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
			 НаборЗаписейДиР.Расход = СтрокаУслуги.СуммаВсего;
			 СуммаУслуг = СуммаУслуг+СтрокаУслуги.СуммаВсего;
			 Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		 КонецЦикла;
		 
		 // способ ведения не по подразделениям то ничего не будем корректировать
	 КонецЕсли;
	 
	 // при безвозмездном поступлении сумму на доходы и расходы
	 Если ШапкаДокумента.ХозОперация=Справочники.ХозОперации.ПоступлениеБезвозмездное Тогда
		 НайденнаяСтрокаТоваров=ДеревоДоходовИРасходов.Строки.Найти(Перечисления.ВидыНоменклатуры.Товар,"ВидНоменклатуры");
		 СуммаСебестоимости = 0;
		 Если НайденнаяСтрокаТоваров<>Неопределено Тогда
			 НаборЗаписейДиР = Движения.ДоходыИРасходы;
			 НаборЗаписейДиР.ДокументОбъект         = ЭтотОбъект;
			 // в случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции
			 Если ВедетсяБалансПоПодразделению Тогда
				 НаборЗаписейДиР.Подразделение          = ШапкаДокумента.СкладКомпании.Подразделение;
			 КонецЕсли;
			 НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Себестоимость;
			 НаборЗаписейДиР.ШапкаДокумента         = ШапкаДокумента;
			 НаборЗаписейДиР.ВУпрВалюте             = Ложь;
			 НаборЗаписейДиР.Доход                  = НайденнаяСтрокаТоваров.СуммаВсего;
			 СуммаСебестоимости                     = СуммаСебестоимости+НайденнаяСтрокаТоваров.СуммаВсего;
			 Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		 КонецЕсли;  		
	 КонецЕсли;
	 
	 // двигаем границу последовательности партий
	 СвойствоСкладКомпанииБыл = неопределено;
	 ДополнительныеСвойства.Свойство("СкладКомпанииБыл",СвойствоСкладКомпанииБыл);
	 Если Режим<>РежимПроведенияДокумента.Оперативный ИЛИ ЗначениеЗаполнено(СвойствоСкладКомпанииБыл) Тогда
		 // если идет допроведение, то надо получить те значения которые были раньше
		 Если Ссылка<>ДокументСсылка Тогда
			 Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор=&Ссылка");
			 Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
			 Результат = Запрос.Выполнить(); СкладКомпанииБыл=Неопределено;
			 Если НЕ Результат.Пустой() Тогда
				 СкладКомпанииБыл = Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании");
			 КонецЕсли;
			 ДополнительныеСвойства.Вставить("СкладКомпанииБыл",СкладКомпанииБыл);
			 ДополнительныеСвойства.МоментВремениБыл = ДокументСсылка.МоментВремени();
		 КонецЕсли;
		 
		 НаборЗаписейГраницыПартий = РегистрыСведений.ГраницыПартий.СоздатьНаборЗаписей();
		 Если Режим<>РежимПроведенияДокумента.Оперативный Тогда
			 НаборЗаписейГраницыПартий.СкладКомпании		= ШапкаДокумента.СкладКомпании;
			 НаборЗаписейГраницыПартий.МоментВремени		= ШапкаДокумента.Дата;
			 НаборЗаписейГраницыПартий.СкладКомпанииБыл	= ДополнительныеСвойства.СкладКомпанииБыл;
			 НаборЗаписейГраницыПартий.МоментВремениБыл	= ДополнительныеСвойства.МоментВремениБыл;
		 Иначе
			 НаборЗаписейГраницыПартий.СкладКомпании		= ДополнительныеСвойства.СкладКомпанииБыл;
			 НаборЗаписейГраницыПартий.МоментВремени		= ДополнительныеСвойства.МоментВремениБыл;
			 НаборЗаписейГраницыПартий.СкладКомпанииБыл	= Неопределено;
			 НаборЗаписейГраницыПартий.МоментВремениБыл	= Неопределено;
		 КонецЕсли;
		 НаборЗаписейГраницыПартий.ДокументСсылка	= ШапкаДокумента.Ссылка;
		 НаборЗаписейГраницыПартий.ИзменитьГраницу();
	 КонецЕсли;
	 
	 Возврат НЕ Отказ;
 КонецФункции // ПровестиПоПартиям()
 
 // Обработка изменения реквизитов документа
 // Параметры
 //  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
 //  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
 //                         производится программная обработка реквизитов.
 //  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
 //										 Имеет смысл только для табличных частей документов.
 //  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
 // Возвращаемое значение:
 //   Булево   – Результат выполнения обработки.
 Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	 // ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	 Если  Имя="ПодразделениеКомпании" Тогда
		 Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		 Возврат Рез;
		 
	 Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		 
	 КонецЕсли;
 КонецФункции // ОбработкаРеквизита()
 
 // возвращает выборку по шапке
 //
 // Параметры:
 //  ДокументСсылка - Ссылка на документ для которого получаем шапку.
 //
 // Возвращаемое значение:
 //  Выборка - выборка по шапке
 //
 Функция ПолучитьШапкуДокумента(ДокументСсылка)
	 Запрос=Новый Запрос("
	 |ВЫБРАТЬ
	 |	Док.Ссылка КАК Ссылка,
	 |	Док.Дата КАК Дата,
	 |	Док.ВалютаДокумента КАК ВалютаДокумента,
	 |	Док.КурсДокумента КАК КурсДокумента,
	 |	Док.ТипЦен КАК ТипЦен,
	 |	Док.ХозОперация КАК ХозОперация,
	 |	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	 |	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	 |	Док.МоментВремени КАК МоментВремени,
	 |	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	 |	Док.Проект КАК Проект,
	 /////////// ПРИВАТ ////////////
	 |	Док.СкладКомпании КАК СкладКомпании,
	 |	Док.СуммаДокумента КАК СуммаДокумента,
	 |	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	 |	Док.ДокументОснование КАК ДокументОснование
	 |
	 |ИЗ
	 |	Документ."+Метаданные().Имя+" КАК Док
	 |ГДЕ
	 |	Док.Ссылка=&Ссылка
	 |");
	 Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	 Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	 
	 Возврат Выборка;
 КонецФункции // ПолучитьШапкуДокумента()
 
 // заполнение свойств из документа основания
 Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
	 //зарезервировано для описания заполнения свойств из свойств основания
 КонецПроцедуры
 
  
 #Если Клиент Тогда
	 
 ////////////////////////////////////////////////////////////////////////////////
 // ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

 	 
 Функция КонтактнаяИнформация(Объект, Вид)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Вид = &Вид
	|	И КонтактнаяИнформация.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Вид", Вид);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Представление;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции
	 
 Функция ПечатьАктПриемаПередачиТмцРаботнику(ТабДокумент) Экспорт
		 
	 Макет = ПолучитьМакет("АктПриемаПередачиТмцРаботнику");
	 
	 //Макет.Параметры.МинимСрокВыполненияЗаказа = СрокПоставкиДней;
	 //Макет.Параметры.МаксСрокВыполненияЗаказа = СрокПоставкиДней;
	 
	 ОбластьМакета = Макет.ПолучитьОбласть("Заголовок"); 
	 
	 ОбластьМакета.Параметры.ТекстЗаголовка	= дкПолучитьПредставление(ЭтотОбъект, "");
	 ОбластьМакета.Параметры.ТекстЗаголовка	= ЭтотОбъект.Номер+" от "+Формат(ЭтотОбъект.Дата,"ДЛФ=DD");
	 
  	 ЗапросПД = Новый Запрос;
	 
	 ЗапросПД.Текст = "ВЫБРАТЬ
	 |	ПодтверждающиеДокументы.Серия,
	 |	ПодтверждающиеДокументы.Номер,
	 |	ПодтверждающиеДокументы.ДатаВыдачи,
	 |	ПодтверждающиеДокументы.КемВыдан
	 |ИЗ
	 |	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	 |ГДЕ
	 |	ПодтверждающиеДокументы.Владелец = &Владелец
	 |	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ВидПодтверждающегоДокумента";
	 
	 ЗапросПД.УстановитьПараметр("Владелец", ЭтотОбъект.Менеджер);
	 ЗапросПД.УстановитьПараметр("ВидПодтверждающегоДокумента",Перечисления.ВидыДокументов.Паспорт);
	 Результат = ЗапросПД.Выполнить().Выбрать();
	 Если Результат.Следующий() Тогда	
		 Опаспорте = Результат.Серия+" "+Результат.Номер+", выдан "+Формат(Результат.ДатаВыдачи, "ДЛФ=Д")+ " г. " + Результат.КемВыдан;
	 КонецЕсли;	
	 ОбластьМакета.Параметры.ПредставлениеСотрудника	= ""+ЭтотОбъект.Менеджер+", паспорт "+Опаспорте;
	 
	 //+", зарегистрирован: "+киПолучитьПредставлениеКИ(ЭтотОбъект.Сотрудник, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
 	 //+", телефон "+	 КонтактнаяИнформация(ЭтотОбъект.Сотрудник, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный)+", E-mail: "+
	 //КонтактнаяИнформация(ЭтотОбъект.Сотрудник, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий)+" "+
	 //КонтактнаяИнформация(ЭтотОбъект.Сотрудник, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
	 
	 ОбластьМакета.Параметры.ПредставлениеОрганизации	= ""+ЭтотОбъект.Организация+" ( Дилерский центр: "+ЭтотОбъект.ДилерскийЦентр+" )";
	 
	Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
		Если ЗначениеЗаполнено(Руководитель) И ТипЗнч(Руководитель)=Тип("Структура") Тогда
			Должность = ", в лице";
			Если ЗначениеЗаполнено(Руководитель.РуководительДолжность) Тогда
				Должность = Должность + " " + СокрЛП(НРег(Руководитель.РуководительДолжность));
			КонецЕсли;
			ОбластьМакета.Параметры.РуководительДолжность = Должность;
			РуководительПредставление = Руководитель.РуководительПредставление;
			ДоверенностьРуководителя = спПолучитьПодтверждающийДокументОбъектаПоВиду(Руководитель.Руководитель,Перечисления.ВидыДокументов.Доверенность);
			Если ЗначениеЗаполнено(ДоверенностьРуководителя) Тогда
				РуководительПредставление = РуководительПредставление + ", действующего  на основании Доверенности №" + ДоверенностьРуководителя.Номер + " от "
											+ Формат(ДоверенностьРуководителя.ДатаВыдачи,"ДЛФ=D"); 
			Иначе
				РуководительПредставление = РуководительПредставление + ", действующего  на основании Устава"; 		
			КонецЕсли;
			ОбластьМакета.Параметры.РуководительПредставление = РуководительПредставление;
		КонецЕсли;

	 
	 //ОбластьМакета.Параметры.основаниеДеятельности = "Устава";
	 //спПолучитьПредставление(ЭтотОбъект.Организация,Новый Структура("АдресЮридический"))+", "+
	 //киПолучитьПредставлениеКИ(ЭтотОбъект.Организация,Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	 
	 ОбластьМакета.Параметры.ПредставлениеГорода = "г.Ростов-на-Дону";
	 ОбластьМакета.Параметры.ПредставлениеДаты =  Формат(ЭтотОбъект.Дата,"ДЛФ=DD");
	 
	 ТабДокумент.Вывести(ОбластьМакета);
	 
	 ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"); 
	 ТабДокумент.Вывести(ОбластьМакета);	
	 
	 ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	 
	 СуммаВсего = 0;
	 
	 ВыборкаТабличнойЧасти = ЭтотОбъект.Товары;
	 Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		 //    //заполняем данные строки
		 СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
		 ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		 ОбластьМакета.Параметры.ТоварНаименование = СтрЗаменить(СтруктураСтроки.ТоварНаименование,", "+СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры.Наименование,"");
		 ОбластьМакета.Параметры.ИнвНомер = СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры.Наименование;
		 СуммаВсего = СуммаВсего + СтрокаТабличнойЧасти.СуммаВсего;
		 ТабДокумент.Вывести(ОбластьМакета);		
	 КонецЦикла;
	 
	 //итоги
	 ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	 СуммаВсего = ВыборкаТабличнойЧасти.Итог("СуммаВсего");
	 ОбластьМакета.Параметры.СуммаВсего = Формат(СуммаВсего,"ЧЦ=15; ЧДЦ=2");
	 //
	 ОбластьМакета.Параметры.СуммаПрописью = "Всего наименований "+ВыборкаТабличнойЧасти.Количество()+" с итоговым количеством "+ЧислоПрописью(ВыборкаТабличнойЧасти.Итог("Количество"), ,",,,,,,,,0")+
	                                         "на сумму " + обЧислоПрописью(СуммаВсего,ЭтотОбъект.ВалютаДокумента);
	 //ОбластьМакета.Параметры.ОтпустилПредставление = ЭтотОбъект.Автор;
	 //ОбластьМакета.Параметры.ПолучилПредставление = ЭтотОбъект.Сотрудник;
	 
	 ТабДокумент.Вывести(ОбластьМакета);	
	 
	 Возврат ТабДокумент;
	 
 КонецФункции // ПечатьАктПриемаПередачиТМЦРаботнику()
	 
 // Функция осуществляет печать произвольного документа.
	 // Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
	 //
	 // Параметры:
	 //	ЭтотОбъект							- ДокументОбъект	- Документ для печати
	 //	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
	 //	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
	 //	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
	 //  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
	 //
	 // Возвращаемое значение:
	 //   ТабличныйДокумент	- Сформированная печатная форма
	 //
 Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
		 Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
 КонецФункции // Печать()
	 
 // Возвращает доступные варианты печати документа
	 // Возвращаемое значение: 
	 //  Структура, каждая строка которой
	 //  соответствует одному из вариантов печати
	 //  Первый элемент структуры - форма по умолчанию
 Функция ПолучитьСписокПечатныхФорм() Экспорт
		 СтруктураМакетов=Новый Структура();
		 СтруктураМакетов.Вставить("АктПриемаПередачиТмцРаботнику", "Акт приёма-передачи ТМЦ работнику");
		 //СтруктураМакетов.Вставить("М4", "М-4 (Приходный ордер)");
		 Возврат СтруктураМакетов;
 КонецФункции // ПолучитьСписокПечатныхФорм()
	 
 #КонецЕсли
 
 // Если Клиент Тогда - завершена клиентская часть
 
 ////////////////////////////////////////////////////////////////////////////////
 // ОБРАБОТЧИКИ СОБЫТИЙ
 
 Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	 Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
 КонецПроцедуры // ПриУстановкеНовогоНомера()
 
 //Бондаренко 20160318 ++
 Функция НайтиОрганизациюПоРегиструСведений(ВыбДЦ)
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	НастройкаПродажиТоваровПриБезвозмездномПоступлении.ДилерскийЦентр,
	 |	НастройкаПродажиТоваровПриБезвозмездномПоступлении.ОрганизацияПокупатель,
	 |	НастройкаПродажиТоваровПриБезвозмездномПоступлении.ПодразделениеОрганизацииПокупателя,
	 |	НастройкаПродажиТоваровПриБезвозмездномПоступлении.СкладОрганизацииПокупателя
	 |ИЗ
	 |	РегистрСведений.НастройкаПродажиТоваровПриБезвозмездномПоступлении КАК НастройкаПродажиТоваровПриБезвозмездномПоступлении
	 |ГДЕ
	 |	НастройкаПродажиТоваровПриБезвозмездномПоступлении.ДилерскийЦентр = &ВыбДЦ";
	 
	 Запрос.УстановитьПараметр("ВыбДЦ", ВыбДЦ);
	 
	 Результат = Запрос.Выполнить().Выгрузить();
	 
	 Возврат Результат;
	 
 КонецФункции // НайтиОрганизациюПоФрагментуНаименования()
 
 Функция НайтиКонтраИдоговорПоРегиструСведений(ВыбОрганизация,ВыбКонтрагент)
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ДоговорыКонтрагентовПоУмолчанию.КонтрагентДляДоговора,
	 |	ДоговорыКонтрагентовПоУмолчанию.Организация,
	 |	ДоговорыКонтрагентовПоУмолчанию.ДоговорПоставки
	 |ИЗ
	 |	РегистрСведений.ДоговорыКонтрагентовПоУмолчанию КАК ДоговорыКонтрагентовПоУмолчанию
	 |ГДЕ
	 |	ДоговорыКонтрагентовПоУмолчанию.Организация = &ВыбОрганизация
	 |	И ДоговорыКонтрагентовПоУмолчанию.КонтрагентДляДоговора = &ВыбКонтрагент";
	 
	 Запрос.УстановитьПараметр("ВыбОрганизация", ВыбОрганизация);
	 Запрос.УстановитьПараметр("ВыбКонтрагент", ВыбКонтрагент);
	 
	 Результат = Запрос.Выполнить().Выгрузить();
	 
	 Возврат Результат;
	 
 КонецФункции // НайтиОрганизациюПоФрагментуНаименования()
 
 //Бондаренко 20160318 --
 
 
 // Процедура - обработчик ввода на основании
 Процедура ОбработкаЗаполнения(Основание) Экспорт
	 
	 Рез=дкОбработкаЗаполнения(ЭтотОбъект, Основание,,ТипЗнч(Основание)<>Тип("ДокументСсылка.КорректировкаЗаказаПоставщику"));
	 
  	 Если ЭтоНовый() Тогда
		 ТипЦен=обПраво("ОсновнойТипЦенЗакупки",Права,,ЭтотОбъект);
		 Менеджер=ПараметрыСеанса.Пользователь.Сотрудник;
		 ХозОперация=Справочники.ХозОперации.ПоступлениеТМЦ;
	 КонецЕсли;
	 
 КонецПроцедуры // ОбработкаЗаполнения()
 
 Процедура ПриКопировании(ОбъектКопирования)
	 Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
	 ВхДокДата = '00010101';
	 ВхДокНомер = "";
	 //Бондаренко++ 20161011 #11446
	 ПроводитьПриНаличииОшибок=Ложь;
	 //Бондаренко-- 20161011 #11446
	 //Гэндальф+++
	 Если ЗначениеЗаполнено(ПодразделениеКомпании) Тогда
		 Если обПолучитьПраваИНастройкиПользователя(ПодразделениеКомпании, "ЗакрытиеЗаказовПоПодразделению", ЭтотОбъект) Тогда
			 ЗакрытиеЗаказовПоПодразделению = Перечисления.ВариантыОтветов.Да;
		 Иначе
			 ЗакрытиеЗаказовПоПодразделению = Перечисления.ВариантыОтветов.Нет;
		 КонецЕсли;
		 СпособКонтроляКорректностиДоговораИСклада = обПолучитьПраваИНастройкиПользователя(ПодразделениеКомпании, "КонтрольКорректностиДоговораИСкладаДокумента", ЭтотОбъект);
		 ЗакрытиеЗаказовПоОрганизации = Ложь;
	 КонецЕсли; 
	 //Гэндальф---
 КонецПроцедуры // ПриКопировании()
 
 Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	 
	 Если ОбменДанными.Загрузка Тогда
		 Возврат;
	 КонецЕсли;
	 
 КонецПроцедуры // ПередЗаписью()
 
 Процедура ПриЗаписи(Отказ)
	 Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
 КонецПроцедуры // ПриЗаписи()
 
 Процедура ПередУдалением(Отказ)
	 Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	 Если Отказ = Ложь Тогда
		 Если Константы.ПартияТоваровОтрицательныхОстатков.Получить() = Ссылка Тогда
			 #Если Клиент Тогда
				 Сообщить("Документ является документом партии отрицательных остатков и не может быть удалён");
			 #КонецЕсли
			 Отказ = Истина;
		 КонецЕсли;
	 КонецЕсли;
 КонецПроцедуры // ПередУдалением()
 
 Процедура ОбработкаУдаленияПроведения(Отказ)
	 Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
 КонецПроцедуры // ОбработкаУдаленияПроведения()
 
 Процедура ОбработкаПроведения(Отказ, Режим)
	 
	 //Движения.ТМЦПереданныеСотрудникам.Очистить();
	 //
	 //Для Каждого ТекСтрокаТовары Из Товары Цикл
	 //    
	 //    Движение = Движения.ТМЦПереданныеСотрудникам.Добавить();
	 //    
	 //    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	 //    Движение.Период = Дата;
	 //    Движение.Сотрудник = Сотрудник;
	 //    Движение.ДилерскийЦентр = ДилерскийЦентр;
	 //    Движение.ПартияТМЦ = Ссылка;
	 //    Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
	 //    Движение.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
	 //    
	 //    Движение.Количество = ТекСтрокаТовары.Количество;
	 //    Движение.Сумма = ТекСтрокаТовары.СуммаВсего;
	 //    Движение.ХозОперация = ХозОперация;
	 //     
	 //КонецЦикла;
	 
 КонецПроцедуры // ОбработкаПроведения()
 
 
 //Гэндальф---
 
 //Бондаренко++ 20180131 
 
 // Получить остатки номенклатуры
 // Номенклатура - СправочникСсылка на номенклатуру
 // Возвращаемое значение Число - остаток номенклатуры
 Функция ПолучитьОстаткиНоменклатурыНаСкладах(Знач СкладКомпании,Номенклатура) Экспорт
	 
	 //Будем считать что остаток нулевой
	 ОстатокНоменклатуры=0;
	 СтруктураОтбора = Новый Структура("Номенклатура",Номенклатура);
	 Если Не ЗначениеЗаполнено(СкладКомпании) Тогда
		 СкладКомпании=Справочники.СкладыКомпании.ПустаяСсылка();
	 КонецЕсли;
	 СтруктураОтбора.Вставить("СкладКомпании", СкладКомпании);
	 
	 СписокСкладовДилерскогоЦентра = Новый СписокЗначений;
	 СписокСкладовДилерскогоЦентра.Добавить(СкладКомпании);
	 
	 ДЦ = СкладКомпании.Подразделение.ДилерскийЦентр;
	 Если Не обЗначениеНеЗаполнено(ДЦ) Тогда
		 СписокСкладовДилерскогоЦентра = СписокСкладовДЦ(ДЦ);
	 КонецЕсли; 
	 
	 Попытка 
		 ДатаОстатков = ЭтотОбъект.Дата;
	 Исключение
		 ДатаОстатков = ТекущаяДата();
	 КонецПопытки; 
	 
	 Запрос = Новый Запрос;
	 
	 //Запрос.Текст = "ВЫБРАТЬ
	 //|	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
	 //|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток-ОстаткиТоваровКомпанииОстатки.РезервОстаток КАК Остаток
	 //|ИЗ
	 //|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&ДатаОстатков,"+?(ЗначениеЗаполнено(СкладКомпании),"СкладКомпании=&СкладКомпании И ","")+" Номенклатура = &Номенклатура  ) КАК ОстаткиТоваровКомпанииОстатки
	 //|";
	 
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
	 |	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток-ОстаткиТоваровКомпанииОстатки.РезервОстаток КАК Остаток
	 |ИЗ
	 |	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(,"+?(ЗначениеЗаполнено(СкладКомпании),"СкладКомпании В (&СписокСкладовДилерскогоЦентра) И ","")+" Номенклатура = &Номенклатура) КАК ОстаткиТоваровКомпанииОстатки
	 |";
	 
	 
	 //Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	 Запрос.УстановитьПараметр("СписокСкладовДилерскогоЦентра", СписокСкладовДилерскогоЦентра);
	 
	 Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	 Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(ДатаОстатков));
	 
	 ВыборкаОстатковНоменклатурыНаСкладах=Запрос.Выполнить().Выбрать();
	 
	 Пока ВыборкаОстатковНоменклатурыНаСкладах.Следующий() Цикл
		 ОстатокНоменклатуры=ОстатокНоменклатуры + ВыборкаОстатковНоменклатурыНаСкладах.Остаток;
	 КонецЦикла; 
	 
	 Возврат ОстатокНоменклатуры;
	 
 КонецФункции
 
 Функция СписокСкладовДЦ(ВыбДЦ)
	 
	 //Сообщить("Работает список складов ДЦ");
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	СкладыКомпании.Ссылка,
	 |	СкладыКомпании.Подразделение.ДилерскийЦентр
	 |ИЗ
	 |	Справочник.СкладыКомпании КАК СкладыКомпании
	 |ГДЕ
	 |	СкладыКомпании.Подразделение.ДилерскийЦентр = &ВыбДЦ";
	 
	 Запрос.УстановитьПараметр("ВыбДЦ", ВыбДЦ);
	 
	 СписокСкладов = Новый СписокЗначений;
	 
	 //ТЗ = Запрос.Выполнить().Выгрузить();
	 // ТЗ.ВыбратьСтроку();
	 
	 СписокСкладов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	 
	 //Сообщить("Список складов ДЦ: "+СписокСкладов);
	 
	 Возврат СписокСкладов;
	 
 КонецФункции // СписокСкладовДЦ()
 
 // Получить остатки номенклатуры
 // Номенклатура - СправочникСсылка на номенклатуру
 //  
 // Возвращаемое значение Число - остаток номенклатуры
 Процедура ПолучитьОстаткиЗаказаНоменклатурыНаСкладах(Знач РодительПодразделения,Знач ПодразделениеКомпании,Номенклатура,ДатаОстатков,ВсегоЗаказано,Просрочено) Экспорт
	 
	 //Будем считать что остаток нулевой
	 ОстатокЗаказаНоменклатуры=0;
	 ОстатокЗаказаНоменклатурыПросрочено=0;
	 ДатаМинусМесяц = ДобавитьМесяц(ДатаОстатков,-1);
	 
	 СтруктураОтбора = Новый Структура("Номенклатура",Номенклатура);
	 
	 Запрос = Новый Запрос;
	 
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ЗаказыПоставщикамОстатки.ЗаказаноОстаток КАК Остаток,
	 |	ЗаказыПоставщикамОстатки.ЗаказПоставщику.ПодразделениеКомпании КАК ПодразделениеКомпании,
	 |	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	 |	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата КАК ДатаЗаказа
	 |ИЗ
	 |	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	 |			&ДатаОстатков,
	 |			Номенклатура = &Номенклатура
	 |				 ) КАК ЗаказыПоставщикамОстатки";
	 
	 //Бондаренко 20160421 ++			   
	 Если РодительПодразделения = ПодразделениеКомпании Тогда
		 Запрос.Текст = Запрос.Текст + "
		 | ГДЕ ЗаказыПоставщикамОстатки.ЗаказПоставщику.ПодразделениеКомпании = &ПодразделениеКомпании";
		 Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	 Иначе	
		 Запрос.Текст = Запрос.Текст + "
		 | ГДЕ ЗаказыПоставщикамОстатки.ЗаказПоставщику.ПодразделениеКомпании В ИЕРАРХИИ (&РодительПодразделения)";
		 Запрос.УстановитьПараметр("РодительПодразделения", РодительПодразделения); 
	 КонецЕсли; 			   
	 //Бондаренко 20160421 --
	 
	 Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	 Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(ДатаОстатков));
	 
	 ВыборкаОстатковЗаказа=Запрос.Выполнить().Выбрать();
	 
	 Пока ВыборкаОстатковЗаказа.Следующий() Цикл
		 Если ВыборкаОстатковЗаказа.ДатаЗаказа < ДатаМинусМесяц Тогда
			 ОстатокЗаказаНоменклатурыПросрочено=ОстатокЗаказаНоменклатурыПросрочено + ВыборкаОстатковЗаказа.Остаток;
		 КонецЕсли;	
		 ОстатокЗаказаНоменклатуры=ОстатокЗаказаНоменклатуры + ВыборкаОстатковЗаказа.Остаток;		
	 КонецЦикла;
	 
	 ВсегоЗаказано = ОстатокЗаказаНоменклатуры;
	 Просрочено 	  = ОстатокЗаказаНоменклатурыПросрочено;	
	 
 КонецПроцедуры //ПолучитьОстаткиЗаказаНоменклатурыНаСкладах()
 
 Функция НайтиОсновнойСклад(Подразделение)
	 
	 НайденныйСклад = Справочники.СкладыКомпании.ПустаяСсылка();
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	СкладыКомпании.Ссылка,
	 |	СкладыКомпании.Подразделение,
	 |	СкладыКомпании.Основной
	 |ИЗ
	 |	Справочник.СкладыКомпании КАК СкладыКомпании
	 |ГДЕ
	 |	СкладыКомпании.ЭтоГруппа = ЛОЖЬ
	 |	И СкладыКомпании.Основной = ИСТИНА
	 |	И СкладыКомпании.Подразделение = &ВыбПодразделение";
	 
	 Запрос.УстановитьПараметр("ВыбПодразделение", Подразделение);
	 
	 Результат = Запрос.Выполнить();
	 
	 ВыборкаДетальныеЗаписи = Результат.Выбрать();
	 
	 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 НайденныйСклад = ВыборкаДетальныеЗаписи.Ссылка;
		 Возврат НайденныйСклад; 
	 КонецЦикла;
	 
	 Возврат НайденныйСклад; 
	 
 КонецФункции // НайтиОсновнойСклад()
 //Бондаренко-- 20180131
 
 ////////////////////////////////////////////////////////////////////////////////
 // ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
 
 // сохранение ссылки на коллекцию прав, настроек и окружения
 Права = Неопределено;
 #Если Клиент Тогда
	 Права = глПрава;
 #КонецЕсли
